import json

# створення словника
database = {
    "Паламарчук": ["Іван", "Петрович", 1980],
    "Гура": ["Наталія", "Володимирівна", 1982],
    "Петренко": ["Олександр", "Савич", 1995],
    "Коваленко": ["Марія", "Віталіївна", 2001],
    "Сидоренко": ["Михайло", "Олександрович", 1978],
    "Ткаченко": ["Ольга", "Миколаївна", 1992],
    "Мельник": ["Володимир", "Олексійович", 1985],
    "Кравченко": ["Анастасія", "Іванівна", 2005],
    "Мартиненко": ["Дмитро", "Петрович", 1990],
    "Кравець": ["Світлана", "Василівна", 1988],
    "Лисенко": ["Юрій", "Олексійович", 1997],
    "Павлюк": ["Олексій", "Якович", 1975]
}

print("Дані створено, зараз записуємо у файл...")

# запис словника в JSON файл
filename = "employees.json"

try:
    with open(filename, "w", encoding="utf-8") as f:
        # змушує записувати українські літери, а не коди Unicode (\u0410, \u0411, \u0412)
        json.dump(database, f, ensure_ascii=False, indent=4)
    
    print(f"Успішно записано у файл '{filename}'")
    print("Перевірте файл у будь-якому текстовому редакторі.")

except Exception as e:
    print(f"Помилка при збереженні файлу: {e}")

# читання та виведення
print("\nЗавантаження даних та виведення -\n")

try:
    with open(filename, "r", encoding="utf-8") as f:
        loaded_data = json.load(f)
    
    # перебір і вивід в консоль
    for surname, details in loaded_data.items():
        print(f"Прізвище: {surname}")
        print(f"  Ім'я: {details[0]}")
        print(f"  По батькові: {details[1]}")
        print(f"  Рік народження: {details[2]}\n")

except FileNotFoundError:
    print(f"Файл '{filename}' не знайдено. Будь ласка, спробуйте застосувати програму ще раз.")
except json.JSONDecodeError:
    print("У файлі виявлено некоректний формат JSON.")
except Exception as e:
    print(f"Сталася неочікувана помилка: {e}")
